results/factorial-final/security-overhead-final-tls-broker5/security-overhead-final-factorial-tls-b5-rf3-isr3-msg102400-tps10000-batch16384-acksall-prod6-complz4-trial3/producer-perf.log
run_id=security-overhead-final-factorial-tls-b5-rf3-isr3-msg102400-tps10000-batch16384-acksall-prod6-complz4-trial3
producer_count=6
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b5-rf3-isr3-msg102400-tps10000-batch16384-acksall-prod6-complz4-trial3/producer-perf-1.log -----
producer_index=1
producer_count=6
producer_records=16667
producer_throughput=1667
1 records sent, 0.1 records/sec (0.01 MB/sec), 7966.0 ms avg latency, 7966.0 ms max latency.
141 records sent, 28.1 records/sec (2.75 MB/sec), 4787.5 ms avg latency, 5683.0 ms max latency.
515 records sent, 102.6 records/sec (10.02 MB/sec), 4293.5 ms avg latency, 5946.0 ms max latency.
665 records sent, 131.8 records/sec (12.87 MB/sec), 1288.4 ms avg latency, 2940.0 ms max latency.
545 records sent, 108.7 records/sec (10.62 MB/sec), 49.8 ms avg latency, 179.0 ms max latency.
684 records sent, 136.8 records/sec (13.36 MB/sec), 28.0 ms avg latency, 120.0 ms max latency.
573 records sent, 114.6 records/sec (11.19 MB/sec), 30.6 ms avg latency, 149.0 ms max latency.
636 records sent, 127.1 records/sec (12.41 MB/sec), 45.2 ms avg latency, 272.0 ms max latency.
648 records sent, 129.6 records/sec (12.65 MB/sec), 27.3 ms avg latency, 106.0 ms max latency.
678 records sent, 135.2 records/sec (13.20 MB/sec), 24.6 ms avg latency, 104.0 ms max latency.
665 records sent, 132.8 records/sec (12.97 MB/sec), 23.5 ms avg latency, 125.0 ms max latency.
687 records sent, 137.4 records/sec (13.42 MB/sec), 24.1 ms avg latency, 134.0 ms max latency.
633 records sent, 126.6 records/sec (12.36 MB/sec), 28.4 ms avg latency, 138.0 ms max latency.
687 records sent, 137.3 records/sec (13.41 MB/sec), 22.8 ms avg latency, 132.0 ms max latency.
675 records sent, 134.1 records/sec (13.09 MB/sec), 21.6 ms avg latency, 101.0 ms max latency.
655 records sent, 130.9 records/sec (12.79 MB/sec), 22.4 ms avg latency, 96.0 ms max latency.
636 records sent, 127.0 records/sec (12.40 MB/sec), 21.1 ms avg latency, 102.0 ms max latency.
780 records sent, 155.9 records/sec (15.23 MB/sec), 29.9 ms avg latency, 155.0 ms max latency.
646 records sent, 129.1 records/sec (12.60 MB/sec), 42.9 ms avg latency, 459.0 ms max latency.
726 records sent, 144.7 records/sec (14.13 MB/sec), 33.7 ms avg latency, 244.0 ms max latency.
679 records sent, 135.7 records/sec (13.26 MB/sec), 23.7 ms avg latency, 117.0 ms max latency.
686 records sent, 137.1 records/sec (13.39 MB/sec), 24.4 ms avg latency, 131.0 ms max latency.
719 records sent, 143.1 records/sec (13.98 MB/sec), 20.0 ms avg latency, 74.0 ms max latency.
752 records sent, 150.4 records/sec (14.68 MB/sec), 26.3 ms avg latency, 108.0 ms max latency.
752 records sent, 149.7 records/sec (14.61 MB/sec), 23.0 ms avg latency, 100.0 ms max latency.
812 records sent, 162.3 records/sec (15.85 MB/sec), 17.3 ms avg latency, 73.0 ms max latency.
16667 records sent, 122.485725 records/sec (11.96 MB/sec), 250.00 ms avg latency, 7966.00 ms max latency, 21 ms 50th, 1883 ms 95th, 5384 ms 99th, 5757 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b5-rf3-isr3-msg102400-tps10000-batch16384-acksall-prod6-complz4-trial3/producer-perf-2.log -----
producer_index=2
producer_count=6
producer_records=16667
producer_throughput=1667
1 records sent, 0.1 records/sec (0.01 MB/sec), 8726.0 ms avg latency, 8726.0 ms max latency.
144 records sent, 27.6 records/sec (2.70 MB/sec), 4501.6 ms avg latency, 5571.0 ms max latency.
270 records sent, 53.8 records/sec (5.26 MB/sec), 6500.4 ms avg latency, 7881.0 ms max latency.
634 records sent, 126.6 records/sec (12.37 MB/sec), 3197.8 ms avg latency, 6988.0 ms max latency.
621 records sent, 124.0 records/sec (12.11 MB/sec), 263.6 ms avg latency, 1367.0 ms max latency.
528 records sent, 105.6 records/sec (10.31 MB/sec), 28.4 ms avg latency, 113.0 ms max latency.
638 records sent, 127.5 records/sec (12.45 MB/sec), 39.6 ms avg latency, 167.0 ms max latency.
673 records sent, 134.2 records/sec (13.11 MB/sec), 33.6 ms avg latency, 190.0 ms max latency.
603 records sent, 120.4 records/sec (11.75 MB/sec), 27.8 ms avg latency, 125.0 ms max latency.
668 records sent, 133.6 records/sec (13.05 MB/sec), 29.1 ms avg latency, 145.0 ms max latency.
638 records sent, 127.2 records/sec (12.42 MB/sec), 27.6 ms avg latency, 180.0 ms max latency.
769 records sent, 151.9 records/sec (14.83 MB/sec), 46.2 ms avg latency, 377.0 ms max latency.
670 records sent, 133.6 records/sec (13.05 MB/sec), 27.8 ms avg latency, 127.0 ms max latency.
703 records sent, 140.5 records/sec (13.72 MB/sec), 21.1 ms avg latency, 76.0 ms max latency.
664 records sent, 132.8 records/sec (12.97 MB/sec), 26.0 ms avg latency, 93.0 ms max latency.
701 records sent, 139.7 records/sec (13.65 MB/sec), 20.9 ms avg latency, 106.0 ms max latency.
693 records sent, 138.0 records/sec (13.48 MB/sec), 33.8 ms avg latency, 232.0 ms max latency.
709 records sent, 141.5 records/sec (13.81 MB/sec), 22.4 ms avg latency, 96.0 ms max latency.
689 records sent, 137.6 records/sec (13.43 MB/sec), 54.3 ms avg latency, 356.0 ms max latency.
676 records sent, 135.1 records/sec (13.19 MB/sec), 19.4 ms avg latency, 67.0 ms max latency.
687 records sent, 137.2 records/sec (13.40 MB/sec), 25.4 ms avg latency, 109.0 ms max latency.
715 records sent, 142.6 records/sec (13.93 MB/sec), 22.0 ms avg latency, 104.0 ms max latency.
696 records sent, 139.0 records/sec (13.58 MB/sec), 20.7 ms avg latency, 117.0 ms max latency.
751 records sent, 150.1 records/sec (14.66 MB/sec), 23.0 ms avg latency, 98.0 ms max latency.
803 records sent, 160.0 records/sec (15.62 MB/sec), 18.6 ms avg latency, 80.0 ms max latency.
819 records sent, 163.3 records/sec (15.95 MB/sec), 17.8 ms avg latency, 83.0 ms max latency.
16667 records sent, 121.597467 records/sec (11.87 MB/sec), 300.68 ms avg latency, 8726.00 ms max latency, 21 ms 50th, 2112 ms 95th, 6450 ms 99th, 7285 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b5-rf3-isr3-msg102400-tps10000-batch16384-acksall-prod6-complz4-trial3/producer-perf-3.log -----
producer_index=3
producer_count=6
producer_records=16667
producer_throughput=1667
1 records sent, 0.1 records/sec (0.01 MB/sec), 8195.0 ms avg latency, 8195.0 ms max latency.
137 records sent, 26.8 records/sec (2.62 MB/sec), 4355.5 ms avg latency, 5444.0 ms max latency.
299 records sent, 59.3 records/sec (5.80 MB/sec), 6396.6 ms avg latency, 7619.0 ms max latency.
592 records sent, 118.3 records/sec (11.56 MB/sec), 3295.1 ms avg latency, 6112.0 ms max latency.
623 records sent, 124.6 records/sec (12.17 MB/sec), 466.1 ms avg latency, 1757.0 ms max latency.
518 records sent, 103.6 records/sec (10.12 MB/sec), 28.8 ms avg latency, 140.0 ms max latency.
614 records sent, 122.7 records/sec (11.98 MB/sec), 40.7 ms avg latency, 167.0 ms max latency.
607 records sent, 121.2 records/sec (11.84 MB/sec), 29.9 ms avg latency, 151.0 ms max latency.
639 records sent, 127.7 records/sec (12.47 MB/sec), 30.1 ms avg latency, 162.0 ms max latency.
661 records sent, 131.8 records/sec (12.87 MB/sec), 29.1 ms avg latency, 120.0 ms max latency.
705 records sent, 140.4 records/sec (13.71 MB/sec), 22.1 ms avg latency, 80.0 ms max latency.
645 records sent, 128.9 records/sec (12.59 MB/sec), 32.4 ms avg latency, 210.0 ms max latency.
701 records sent, 140.0 records/sec (13.67 MB/sec), 31.9 ms avg latency, 145.0 ms max latency.
670 records sent, 133.5 records/sec (13.04 MB/sec), 24.2 ms avg latency, 114.0 ms max latency.
706 records sent, 140.8 records/sec (13.75 MB/sec), 30.0 ms avg latency, 122.0 ms max latency.
683 records sent, 136.5 records/sec (13.33 MB/sec), 24.5 ms avg latency, 145.0 ms max latency.
652 records sent, 129.8 records/sec (12.68 MB/sec), 21.4 ms avg latency, 83.0 ms max latency.
734 records sent, 146.8 records/sec (14.33 MB/sec), 30.5 ms avg latency, 106.0 ms max latency.
671 records sent, 134.1 records/sec (13.09 MB/sec), 66.3 ms avg latency, 409.0 ms max latency.
747 records sent, 149.1 records/sec (14.56 MB/sec), 24.8 ms avg latency, 147.0 ms max latency.
713 records sent, 142.5 records/sec (13.91 MB/sec), 24.9 ms avg latency, 133.0 ms max latency.
668 records sent, 132.6 records/sec (12.95 MB/sec), 19.4 ms avg latency, 97.0 ms max latency.
704 records sent, 140.7 records/sec (13.74 MB/sec), 26.2 ms avg latency, 115.0 ms max latency.
753 records sent, 150.5 records/sec (14.70 MB/sec), 24.0 ms avg latency, 109.0 ms max latency.
723 records sent, 144.5 records/sec (14.12 MB/sec), 21.6 ms avg latency, 139.0 ms max latency.
881 records sent, 175.3 records/sec (17.12 MB/sec), 21.1 ms avg latency, 111.0 ms max latency.
16667 records sent, 121.710238 records/sec (11.89 MB/sec), 310.74 ms avg latency, 8195.00 ms max latency, 22 ms 50th, 2559 ms 95th, 6269 ms 99th, 7308 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b5-rf3-isr3-msg102400-tps10000-batch16384-acksall-prod6-complz4-trial3/producer-perf-4.log -----
producer_index=4
producer_count=6
producer_records=16667
producer_throughput=1667
1 records sent, 0.1 records/sec (0.01 MB/sec), 3043.0 ms avg latency, 3043.0 ms max latency.
148 records sent, 29.0 records/sec (2.84 MB/sec), 4828.0 ms avg latency, 8408.0 ms max latency.
371 records sent, 73.5 records/sec (7.18 MB/sec), 5725.1 ms avg latency, 6904.0 ms max latency.
615 records sent, 122.7 records/sec (11.98 MB/sec), 2569.5 ms avg latency, 4514.0 ms max latency.
582 records sent, 116.2 records/sec (11.34 MB/sec), 196.2 ms avg latency, 1302.0 ms max latency.
598 records sent, 118.8 records/sec (11.60 MB/sec), 24.5 ms avg latency, 101.0 ms max latency.
614 records sent, 122.4 records/sec (11.95 MB/sec), 39.5 ms avg latency, 156.0 ms max latency.
655 records sent, 130.4 records/sec (12.73 MB/sec), 31.5 ms avg latency, 122.0 ms max latency.
679 records sent, 135.6 records/sec (13.24 MB/sec), 27.3 ms avg latency, 112.0 ms max latency.
641 records sent, 128.0 records/sec (12.50 MB/sec), 41.3 ms avg latency, 227.0 ms max latency.
671 records sent, 134.2 records/sec (13.11 MB/sec), 27.8 ms avg latency, 141.0 ms max latency.
684 records sent, 136.7 records/sec (13.35 MB/sec), 29.7 ms avg latency, 140.0 ms max latency.
617 records sent, 123.2 records/sec (12.03 MB/sec), 26.2 ms avg latency, 89.0 ms max latency.
711 records sent, 141.6 records/sec (13.83 MB/sec), 27.0 ms avg latency, 194.0 ms max latency.
683 records sent, 136.5 records/sec (13.33 MB/sec), 21.9 ms avg latency, 84.0 ms max latency.
673 records sent, 134.4 records/sec (13.12 MB/sec), 23.5 ms avg latency, 92.0 ms max latency.
678 records sent, 135.0 records/sec (13.18 MB/sec), 24.3 ms avg latency, 116.0 ms max latency.
636 records sent, 127.1 records/sec (12.42 MB/sec), 26.8 ms avg latency, 138.0 ms max latency.
657 records sent, 130.4 records/sec (12.74 MB/sec), 53.9 ms avg latency, 324.0 ms max latency.
753 records sent, 150.4 records/sec (14.69 MB/sec), 27.3 ms avg latency, 292.0 ms max latency.
693 records sent, 138.4 records/sec (13.51 MB/sec), 21.5 ms avg latency, 95.0 ms max latency.
701 records sent, 139.9 records/sec (13.66 MB/sec), 25.5 ms avg latency, 112.0 ms max latency.
749 records sent, 149.8 records/sec (14.63 MB/sec), 23.4 ms avg latency, 125.0 ms max latency.
751 records sent, 150.2 records/sec (14.67 MB/sec), 24.6 ms avg latency, 110.0 ms max latency.
748 records sent, 149.6 records/sec (14.61 MB/sec), 19.9 ms avg latency, 141.0 ms max latency.
967 records sent, 192.5 records/sec (18.80 MB/sec), 26.7 ms avg latency, 158.0 ms max latency.
16667 records sent, 122.062324 records/sec (11.92 MB/sec), 297.07 ms avg latency, 8408.00 ms max latency, 22 ms 50th, 2526 ms 95th, 5894 ms 99th, 6732 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b5-rf3-isr3-msg102400-tps10000-batch16384-acksall-prod6-complz4-trial3/producer-perf-5.log -----
producer_index=5
producer_count=6
producer_records=16666
producer_throughput=1666
1 records sent, 0.1 records/sec (0.01 MB/sec), 8079.0 ms avg latency, 8079.0 ms max latency.
129 records sent, 25.2 records/sec (2.46 MB/sec), 4387.9 ms avg latency, 5411.0 ms max latency.
317 records sent, 62.8 records/sec (6.13 MB/sec), 5460.7 ms avg latency, 6365.0 ms max latency.
318 records sent, 63.4 records/sec (6.19 MB/sec), 5483.4 ms avg latency, 6141.0 ms max latency.
807 records sent, 160.5 records/sec (15.67 MB/sec), 2018.4 ms avg latency, 5539.0 ms max latency.
536 records sent, 106.6 records/sec (10.41 MB/sec), 29.7 ms avg latency, 132.0 ms max latency.
629 records sent, 125.7 records/sec (12.28 MB/sec), 41.4 ms avg latency, 193.0 ms max latency.
620 records sent, 123.8 records/sec (12.09 MB/sec), 25.8 ms avg latency, 118.0 ms max latency.
689 records sent, 137.6 records/sec (13.44 MB/sec), 30.2 ms avg latency, 154.0 ms max latency.
639 records sent, 127.7 records/sec (12.47 MB/sec), 26.7 ms avg latency, 101.0 ms max latency.
678 records sent, 134.8 records/sec (13.17 MB/sec), 25.3 ms avg latency, 129.0 ms max latency.
665 records sent, 132.4 records/sec (12.93 MB/sec), 21.4 ms avg latency, 103.0 ms max latency.
668 records sent, 133.5 records/sec (13.04 MB/sec), 29.5 ms avg latency, 194.0 ms max latency.
651 records sent, 130.0 records/sec (12.70 MB/sec), 26.0 ms avg latency, 131.0 ms max latency.
680 records sent, 135.6 records/sec (13.24 MB/sec), 23.8 ms avg latency, 91.0 ms max latency.
702 records sent, 140.2 records/sec (13.69 MB/sec), 21.3 ms avg latency, 96.0 ms max latency.
730 records sent, 145.4 records/sec (14.20 MB/sec), 46.2 ms avg latency, 280.0 ms max latency.
661 records sent, 132.2 records/sec (12.91 MB/sec), 22.9 ms avg latency, 88.0 ms max latency.
704 records sent, 140.4 records/sec (13.71 MB/sec), 49.5 ms avg latency, 344.0 ms max latency.
687 records sent, 137.2 records/sec (13.40 MB/sec), 32.0 ms avg latency, 256.0 ms max latency.
696 records sent, 138.3 records/sec (13.50 MB/sec), 21.7 ms avg latency, 123.0 ms max latency.
710 records sent, 141.9 records/sec (13.85 MB/sec), 23.8 ms avg latency, 115.0 ms max latency.
653 records sent, 130.3 records/sec (12.73 MB/sec), 19.0 ms avg latency, 77.0 ms max latency.
744 records sent, 148.7 records/sec (14.52 MB/sec), 28.5 ms avg latency, 145.0 ms max latency.
767 records sent, 153.3 records/sec (14.97 MB/sec), 22.6 ms avg latency, 93.0 ms max latency.
873 records sent, 174.1 records/sec (17.01 MB/sec), 24.9 ms avg latency, 159.0 ms max latency.
16666 records sent, 120.960952 records/sec (11.81 MB/sec), 365.72 ms avg latency, 8079.00 ms max latency, 21 ms 50th, 4144 ms 95th, 5645 ms 99th, 6001 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b5-rf3-isr3-msg102400-tps10000-batch16384-acksall-prod6-complz4-trial3/producer-perf-6.log -----
producer_index=6
producer_count=6
producer_records=16666
producer_throughput=1666
1 records sent, 0.1 records/sec (0.01 MB/sec), 8425.0 ms avg latency, 8425.0 ms max latency.
132 records sent, 26.2 records/sec (2.56 MB/sec), 4436.8 ms avg latency, 5434.0 ms max latency.
269 records sent, 52.9 records/sec (5.17 MB/sec), 6272.3 ms avg latency, 7268.0 ms max latency.
350 records sent, 69.1 records/sec (6.75 MB/sec), 5940.3 ms avg latency, 7231.0 ms max latency.
747 records sent, 149.1 records/sec (14.56 MB/sec), 1784.4 ms avg latency, 4908.0 ms max latency.
545 records sent, 108.4 records/sec (10.59 MB/sec), 35.9 ms avg latency, 228.0 ms max latency.
591 records sent, 118.2 records/sec (11.54 MB/sec), 29.2 ms avg latency, 90.0 ms max latency.
570 records sent, 114.0 records/sec (11.13 MB/sec), 39.3 ms avg latency, 191.0 ms max latency.
674 records sent, 134.6 records/sec (13.15 MB/sec), 27.7 ms avg latency, 93.0 ms max latency.
618 records sent, 123.0 records/sec (12.01 MB/sec), 25.3 ms avg latency, 131.0 ms max latency.
670 records sent, 134.0 records/sec (13.08 MB/sec), 24.7 ms avg latency, 109.0 ms max latency.
627 records sent, 125.4 records/sec (12.25 MB/sec), 24.8 ms avg latency, 103.0 ms max latency.
695 records sent, 138.6 records/sec (13.53 MB/sec), 33.3 ms avg latency, 117.0 ms max latency.
670 records sent, 134.0 records/sec (13.08 MB/sec), 23.4 ms avg latency, 136.0 ms max latency.
698 records sent, 139.5 records/sec (13.63 MB/sec), 29.1 ms avg latency, 174.0 ms max latency.
693 records sent, 138.1 records/sec (13.48 MB/sec), 24.1 ms avg latency, 117.0 ms max latency.
749 records sent, 149.7 records/sec (14.62 MB/sec), 20.3 ms avg latency, 96.0 ms max latency.
648 records sent, 129.4 records/sec (12.64 MB/sec), 24.4 ms avg latency, 101.0 ms max latency.
726 records sent, 144.9 records/sec (14.15 MB/sec), 63.1 ms avg latency, 397.0 ms max latency.
717 records sent, 143.3 records/sec (14.00 MB/sec), 23.2 ms avg latency, 86.0 ms max latency.
709 records sent, 141.1 records/sec (13.78 MB/sec), 22.3 ms avg latency, 118.0 ms max latency.
760 records sent, 151.9 records/sec (14.83 MB/sec), 21.6 ms avg latency, 123.0 ms max latency.
697 records sent, 138.7 records/sec (13.54 MB/sec), 23.9 ms avg latency, 93.0 ms max latency.
730 records sent, 145.9 records/sec (14.24 MB/sec), 22.7 ms avg latency, 99.0 ms max latency.
750 records sent, 149.8 records/sec (14.63 MB/sec), 17.5 ms avg latency, 68.0 ms max latency.
829 records sent, 165.5 records/sec (16.16 MB/sec), 15.5 ms avg latency, 52.0 ms max latency.
16666 records sent, 121.278717 records/sec (11.84 MB/sec), 365.61 ms avg latency, 8425.00 ms max latency, 21 ms 50th, 3581 ms 95th, 6417 ms 99th, 7115 ms 99.9th.